Documents/бит_ФайлыГИСЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_ФайлыГИСЖКХ</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолговойПД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрисоединенныйФайл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СворачиватьТаблицу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонВыгрузкиГИСЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ШаблоныВыгрузкиГИСЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонИзвещений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьКоличествоДопУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СворачиватьТаблицуГорячегоВодоснабжения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СворачиватьТаблицуХолодногоВодоснабжения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьКомнаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсеДома</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Нежилые</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Жилые</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЗданий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Здание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокУлиц</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Улица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокЛС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Метка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыОплат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>метка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОплаты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_СведенияОКвартире.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияОКвартире</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МОП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтапливаемаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СовокупнаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПлиты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыПлиты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗапирающегоУстройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыЗапирающихУстройств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилоеПомещениеСпециализированногоЖилищногоФонда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИЭлектроснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИВодоснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысотаПотолков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПредставлениеКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьСальдоСвоихУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_НеВыводитьСтрокуДомофон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПлощадьКапремонта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ДаНет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ДаНет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/бит_ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ЛицевыеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемПрефикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВестиРасчетПени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьПоГруппам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЛицевогоСчетаГИСЖКХ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипЛицевогоСчетаГИСЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УлицаЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Льготный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/бит_ФайлыГИСЖКХ/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		
		//+!  изменено ГВВ 23.08.2022 https://firstbitone.freshdesk.com/a/tickets/5604
		//Отказ = Истина;
		//ТекстСообщения = НСтр("ru = 'Запрещено создавать документ копированием.'");
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		//Возврат;
		ПрисоединенныйФайл = неопределено;
		//-! 
	КонецЕсли;

	
	НастройкиДоступа();
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Организация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	Иначе
		ДвоичныеДанныеПрисоединенныйФайл = ПолучитьПрисоединенныйФайл(Объект.Ссылка);
		ДанныеФайла = ДвоичныеДанныеПрисоединенныйФайл;	
	КонецЕсли;
	
	Если ЭтоШаблонПлатежногоДокумента(Объект.ШаблонВыгрузкиГИСЖКХ) Тогда
		Элементы.ШаблонИзвещений.Видимость = Истина;
		Элементы.ДолговойПД.Видимость = Истина;
	Иначе
		Элементы.ШаблонИзвещений.Видимость = Ложь;
		Элементы.ДолговойПД.Видимость = Ложь;
	КонецЕсли;
	
	//11.11.2019
	//11.09.2020
	если строка(Объект.ШаблонВыгрузкиГИСЖКХ) = "Шаблон импорт платежных документов" ИЛИ 
               	строка(Объект.ШаблонВыгрузкиГИСЖКХ) = "Шаблон импорт платежных документов 2020" тогда	
		Элементы.ГруппаСверткиВодоснабжения.Видимость = истина;
	иначе
		Элементы.ГруппаСверткиВодоснабжения.Видимость = ложь;
	КонецЕсли; 
	
	Объект.ВсеДома = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Запись макета.
	Если ЗначениеЗаполнено(ДанныеФайла) Тогда
		Попытка
			ТекущийОбъект.ПрисоединенныйФайл = Новый ХранилищеЗначения(ДанныеФайла, Новый СжатиеДанных(9));
		Исключение
		КонецПопытки;
	КонецЕсли;

	СтруктураДанныхМакета = Неопределено;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	НастройкиДоступа();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Укажите файл";
	Диалог.Фильтр    = "(*.xlsx;*.xls)|*.xlsx;*.xls";
	ОписаниеОповещения = Новый ОписаниеОповещения("ПолучитьПутьКаталогаЗавершение", ЭтотОбъект);
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПутьКаталогаЗавершение(ВыбранныйКаталог, ВходящийКонтекст) Экспорт
	
	Если ТипЗнч(ВыбранныйКаталог) = Тип("Массив") И ВыбранныйКаталог.Количество() > 0 Тогда 
		Каталог = ВыбранныйКаталог[0];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Каталог) Тогда
		ЗапуститьПриложение(Каталог);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУлицОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Для Каждого Элт Из ВыбранноеЗначение Цикл
		Если Элт = Неопределено
			ИЛИ Элт = ПредопределенноеЗначение("Справочник.бит_СписокУлиц.ПустаяСсылка") Тогда
			Продолжить;	
		КонецЕсли;
		НоваяСтрока = Объект.СписокУлиц.Добавить();
		НоваяСтрока.Улица = Элт;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗданийОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Для Каждого Элт Из ВыбранноеЗначение Цикл
		Если Элт = Неопределено
			ИЛИ Элт = ПредопределенноеЗначение("Справочник.бит_СписокЗданий.ПустаяСсылка") Тогда
			Продолжить;	
		КонецЕсли;
		НоваяСтрока = Объект.СписокЗданий.Добавить();
		НоваяСтрока.Здание = Элт;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Для Каждого Элт Из ВыбранноеЗначение Цикл
		Если Элт = Неопределено
			ИЛИ элт = ПредопределенноеЗначение("Справочник.бит_ЛицевыеСчета.ПустаяСсылка") Тогда
			Продолжить;	
		КонецЕсли;
		НоваяСтрока = Объект.СписокЛС.Добавить();
		НоваяСтрока.ЛицевойСчет = Элт;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныВыгрузкиГИСЖКХОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЭтоШаблонПлатежногоДокумента(ВыбранноеЗначение) Тогда
		
		Элементы.ШаблонИзвещений.Видимость = Истина;
		Элементы.ДолговойПД.Видимость = Истина;
		Если НЕ ЗначениеЗаполнено(Объект.ДолговойПД) Тогда
			Объект.ДолговойПД = ПредопределенноеЗначение("Перечисление.ДаНет.Нет");
		КонецЕсли;
		Элементы.ВыводитьКоличествоДопУслуг.Видимость = Истина; 
	Иначе
		Элементы.ШаблонИзвещений.Видимость = Ложь;
		Элементы.ДолговойПД.Видимость = Ложь;
		Объект.ДолговойПД = ПредопределенноеЗначение("Перечисление.ДаНет.ПустаяСсылка");
		Элементы.ВыводитьКоличествоДопУслуг.Видимость = Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ШаблонИзвещений) Тогда
		Объект.ШаблонИзвещений = ПредопределенноеЗначение("Справочник.бит_ШаблоныИзвещений.ПоВсемУслугам");
	КонецЕсли;	
	
	//11.11.2019
	//11.09.2020
	если строка(ВыбранноеЗначение) = "Шаблон импорт платежных документов" ИЛИ 
		  строка(ВыбранноеЗначение) = "Шаблон импорт платежных документов 2020" тогда
		ЭтаФорма.Элементы.ГруппаСверткиВодоснабжения.Видимость = истина;
	иначе
		ЭтаФорма.Элементы.ГруппаСверткиВодоснабжения.Видимость = ложь;
	КонецЕсли;  
	
	//23.04.2020
	если строка(ВыбранноеЗначение) <> "Шаблон импорта ЛС" тогда
		ЭтаФорма.Элементы.ВыводитьКомнаты.Видимость = ложь;
	иначе
		ЭтаФорма.Элементы.ВыводитьКомнаты.Видимость = истина;
	КонецЕсли;   
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОчиститьЗдания(Команда)
	
	Объект.СписокЗданий.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЛС(Команда)
	
	Объект.СписокЛС.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьУлицы(Команда)
	
	Объект.СписокУлиц.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	#Если НЕ ВебКлиент Тогда
		Если ЗначениеЗаполнено(ДанныеФайла) Тогда
			ОчиститьСообщения();
			
			//ИмяВрФайла = ПолучитьИмяВременногоФайла("xlsx");
			//ДанныеФайла.Записать(ИмяВрФайла);
			//ЗапуститьПриложение(ИмяВрФайла);
			
			КаталогВФ = КаталогВременныхФайлов();
			ИмяВрФайла = КаталогВФ + "\битГИСЖКХ\" + Строка(Объект.ШаблонВыгрузкиГИСЖКХ) + Формат(ТекущаяДата(), "ДФ='ддММггччммсс'") + ".xlsx";
			Попытка
				УдалитьФайлы(КаталогВФ + "\битГИСЖКХ");
			Исключение
			КонецПопытки;
			
			ТекстСообщения = НСтр("ru = 'Выполняется открытие файла. Подождите...'");
			Состояние(НСтр("ru = 'Запуск Excel.'"), , ТекстСообщения);

			Попытка
				Excel = Новый COMОбъект("Excel.Application");
			Исключение
				ТекстСообщения = НСтр("ru = 'Ошибка загрузки Microsoft Excel.'") + Символы.ПС + ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Возврат;
			КонецПопытки;
			
			Если Excel = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			Попытка
				ДанныеФайла.Записать(ИмяВрФайла);
				Книга			= Excel.Application.WorkBooks.Open(ИмяВрФайла);
				Excel.Visible	= Истина;
				Книга.Activate();
				// Меняем состояние окна Excel (Свернуть/Развернуть), чтобы переключить фокус.
				Excel.WindowState = -4140;
				Excel.WindowState = -4137;
				
			Исключение
				ТекстСообщения = НСтр("ru = 'Не удалось открыть Excel - .'") + Символы.ПС + ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				
				Excel.Quit();
				
				Попытка
					УдалитьФайлы(КаталогВФ + "\битГИСЖКХ");
				Исключение
				КонецПопытки;

			КонецПопытки;
			
		КонецЕсли;	
	#Иначе
		Возврат;	
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьФайл(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Укажите файл";
	Диалог.Фильтр    = "(*.xlsx;*.xls)|*.xlsx;*.xls";
	ОписаниеОповещения = Новый ОписаниеОповещения("ПолучитьПутьФайлаЗаменыЗавершение", ЭтотОбъект);
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПутьФайлаЗаменыЗавершение(ВыбранныйФайл, ВходящийКонтекст) Экспорт
	
	Если ТипЗнч(ВыбранныйФайл) = Тип("Массив") И ВыбранныйФайл.Количество() > 0 Тогда 
		Попытка
			ДанныеФайла = Новый ДвоичныеДанные(ВыбранныйФайл[0]);
			Модифицированность = Истина;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли; 

	ПоказатьОповещениеПользователя("Чтение и подготовка данных...");
	
	СформироватьФайлСервер();
	
	Если СтруктураДанныхМакета.Количество() = 0 Тогда
		ОчиститьСообщения();
		ТекстСообщения = НСтр("ru = 'Отсутствуют настройки шаблона выгрузки ГИС ЖКХ.'");
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		Возврат;	
	КонецЕсли;
	
	ПутьФайла = СформироватьФайлExcel();
	Если НЕ ПутьФайла = Неопределено Тогда
		ДанныеФайла = Новый ДвоичныеДанные(ПутьФайла);
		Модифицированность = Истина;
	КонецЕсли;
	НастройкиДоступа();
	Если НЕ ЗначениеЗаполнено(Каталог) Тогда
		Попытка
			УдалитьФайлы(ПутьФайла);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Если ПутьФайла = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Не удалось сформировать файл.'");
	Иначе	
		ТекстСообщения = НСтр("ru = 'Формирование файла завершено.'");
	КонецЕсли;
	
	ОчиститьСообщения();
	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборЗданий(Команда)
	
	ПарамОтбора = Новый Структура("ПометкаУдаления", Ложь);
	ПараметрыОткрытия = Новый Структура("РежимВыбора, МножественныйВыбор, ЗакрыватьПриВыборе, Отбор", Истина, Истина, Ложь, ПарамОтбора);
	ОткрытьФорму("Справочник.бит_СписокЗданий.ФормаВыбора", ПараметрыОткрытия, Элементы.СписокЗданий, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборУлиц(Команда)
	
	ПарамОтбора = Новый Структура("ПометкаУдаления", Ложь);
	ПараметрыОткрытия = Новый Структура("РежимВыбора, МножественныйВыбор, ЗакрыватьПриВыборе, Отбор", Истина, Истина, Ложь, ПарамОтбора);
	ОткрытьФорму("Справочник.бит_СписокУлиц.ФормаВыбора", ПараметрыОткрытия, Элементы.СписокУлиц, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборЛС(Команда)
	
	ПарамОтбора = Новый Структура("ПометкаУдаления, Архивный", Ложь, Ложь);
	ПараметрыОткрытия = Новый Структура("РежимВыбора, МножественныйВыбор, ЗакрыватьПриВыборе, Отбор", Истина, Истина, Ложь, ПарамОтбора);
	ОткрытьФорму("Справочник.бит_ЛицевыеСчета.ФормаВыбора", ПараметрыОткрытия, Элементы.СписокЛС, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастройкиДоступа()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) И НЕ ПолучитьПрисоединенныйФайл(Объект.Ссылка) = Неопределено Тогда
		Элементы.ФормаОткрытьФайл.Доступность = Истина;
		Элементы.ФормаЗаменитьФайл.Доступность = Истина;
	ИначеЕсли ЗначениеЗаполнено(ДанныеФайла) Тогда
		Элементы.ФормаОткрытьФайл.Доступность = Истина;
		Элементы.ФормаЗаменитьФайл.Доступность = Истина;
	Иначе
		Элементы.ФормаОткрытьФайл.Доступность = Ложь;
		Элементы.ФормаЗаменитьФайл.Доступность = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПрисоединенныйФайл(Ссылка)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПрисоединенныйФайл").Получить();
	
КонецФункции

&НаКлиенте
Функция СформироватьФайлExcel()
	
	#Если НЕ ВебКлиент Тогда
		Если ЗначениеЗаполнено(Объект.ШаблонВыгрузкиГИСЖКХ) Тогда
			
			ДвоичныеДанные = ПолучитьМакетСтраницыСервер(Объект.ШаблонВыгрузкиГИСЖКХ);
			Если ДвоичныеДанные = Неопределено Тогда
				Возврат Неопределено;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Каталог) Тогда
				ПутьФайла = ПолучитьИмяВременногоФайла("xlsx");
			Иначе
				ПутьФайла = Каталог;
			КонецЕсли;
			
			
			Попытка
				ДвоичныеДанные.Записать(ПутьФайла);
			Исключение
				ТекстСообщения = НСтр("ru = 'Ошибка работы с файлом.'") + Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()) + ".";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Возврат Неопределено;
			КонецПопытки;
		Иначе
			
			Возврат Неопределено;
			
		КонецЕсли;
		
		// Создадим приложение Excel.
		ЕстьОшибки = Ложь;
		Excel = бит_ВыгрузкаКлиент.СоздатьПриложениеExcel();
		Excel.DisplayAlerts = False;
		
		Если Excel = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Попытка
			Книга				= Excel.Application.WorkBooks.Open(ПутьФайла);
			МассивЛистовКниги	= Книга.WorkSheets;
			
			НомерСтраницыExcel	= 1; 										// Номер страницы в шаблоне Excel.
			КолВоСтраницВШаблоне= Дерево.ПолучитьЭлементы().Количество();   // Количество страниц в шаблоне разметки.
			
			// Обход страниц макета.
			Для Каждого ExcelЛист Из МассивЛистовКниги Цикл
				
				Если ExcelЛист.Visible = 0 Тогда
					Продолжить;	
				КонецЕсли;
				
				// ТаблицаШаблона.
				ИнфоТаблицыШаблона	= НайтиТиблицуШаблона(НомерСтраницыExcel);
				ТаблицаШаблона		= ИнфоТаблицыШаблона.ТаблицаШаблона;
				НомерСтраницыШаблона= ИнфоТаблицыШаблона.НомерСтраницыШаблона;
				Если ТаблицаШаблона = Неопределено Тогда
					НомерСтраницыExcel = НомерСтраницыExcel + 1;
					Продолжить; // Переходи к следующей странице Excel.
				КонецЕсли;
				ИмяТаблицыШаблона = ТаблицаШаблона.Поле;
				
				// Получение подготовленной таблицы данных.
				ТаблицаДанных = Новый Массив;
				ТаблицаДанных = СтруктураДанныхМакета.Получить(ИмяТаблицыШаблона);
				Если ТаблицаДанных = Неопределено ИЛИ ТаблицаДанных.Количество() = 0 Тогда
					НомерСтраницыExcel = НомерСтраницыExcel + 1;
					Продолжить;
				КонецЕсли;
				
				НомерНачальнойСтроки= ТаблицаШаблона.НомерНачальнойСтроки;
				НомерСтроки			= ТаблицаШаблона.НомерНачальнойСтроки;
				Если НомерСтроки = 0 Тогда
					НомерСтраницыExcel = НомерСтраницыExcel + 1;
					Продолжить;
				КонецЕсли;
				
				// Обход Данных.
				СтрокиТаблицыШаблона = ТаблицаШаблона.ПолучитьЭлементы();
				
				ВсегоСтрок	= ТаблицаДанных.Количество();
				ВсегоКолонок= НайтиПоследнююКолонку(СтрокиТаблицыШаблона);
				МассивКОМ	= Новый COMSafeArray("VT_VARIANT", ВсегоКолонок, ВсегоСтрок);
				НомерСтрокиМассива = 0;
				
				// Обход строк данных.
				Для Каждого СтрТДанных Из ТаблицаДанных Цикл
					////++Мельник 241121 Отбор по типу квартиры ЛС
					//Если СтрТДанных.Свойство("ЛицевойСчет") Тогда
					//	ПроверкаТипаКвартиры = ПроверитьТипКвартиры(СтрТДанных.ЛицевойСчет);
					//Иначе
					//	ПроверкаТипаКвартиры = Ложь;
					//КонецЕсли;
					//Если ПроверкаТипаКвартиры Тогда
					//	Продолжить;
					//КонецЕсли;
					////--Мельник 241121
					// Работа с индикатором.
					ТекстСообщения = НСтр("ru = 'Заполнение %1 страницы из %2.'");
					ТекстСообщения = СтрШаблон(ТекстСообщения, НомерСтраницыШаблона, КолВоСтраницВШаблоне); 
					ТекущийПроцент = Окр(НомерСтроки/ТаблицаДанных.Количество() * 100);
					Состояние(НСтр("ru = 'Загрузка Microsoft Excel...'"), ТекущийПроцент, ТекстСообщения);
					
					// Обход колонок шаблона.
					Для Каждого Элт Из СтрокиТаблицыШаблона Цикл
						
						Если Элт.СтраницаКолонка = 0 Тогда
							Продолжить;
						КонецЕсли;
						
						МассивКОМ.SetValue(Элт.СтраницаКолонка-1, НомерСтрокиМассива, СтрТДанных[Элт.Поле]);
						
					КонецЦикла; // Обход колонок шаблона.	
					//+! ГВВ пронумеруем строки шаблона оплат  Схема СКД + заполнение не позволяют нормально сделать
					Если  лев(ИмяТаблицыШаблона,14) = "Таблица оплаты" тогда
						МассивКОМ.SetValue(0,НомерСтрокиМассива, НомерСтрокиМассива+1);
					КонецЕсли;
					//-! ГВВ
					
					НомерСтрокиМассива = НомерСтрокиМассива + 1;
					НомерСтроки = НомерСтроки + 1;
					
					
				КонецЦикла; // Обход строк данных.
				
				Если ВсегоКолонок <> 0 Тогда
					ExcelЛист.Range(ExcelЛист.Cells(НомерНачальнойСтроки,1), ExcelЛист.Cells(НомерСтроки - 1,ВсегоКолонок)).Value = МассивКОМ;
				КонецЕсли;
				
				МассивКОМ = Неопределено;
				НомерСтраницыExcel = НомерСтраницыExcel + 1;
			КонецЦикла; // Обход страниц макета.
			
			Книга.ConflictResolution = 1;
			Книга.Save();
			Excel.Quit();
			
			Возврат ПутьФайла;
			
		Исключение
			ТекстСообщения = НСтр("ru = 'Не удалось заполнить лист Excel - .'") + Символы.ПС + ОписаниеОшибки();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Excel.Quit();
			Возврат Неопределено;
			
		КонецПопытки;
	#Иначе
		Возврат Неопределено;
	#КонецЕсли
	
КонецФункции

&НаСервере
Функция ПроверитьТипКвартиры(ЛицевойСчет) //++ Мельник 241121 Проверяем соответствие типа квартиры с указанным отбором
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры
	|ИЗ
	|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Дата, Квартира = &Квартира) КАК бит_СведенияОКвартиреСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Квартира", ЛицевойСчет.Квартира);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Нежилое = ВыборкаДетальныеЗаписи.ТипКвартиры = Справочники.бит_ТипыКвартиры.НежилоеПомещение;
		Если Нежилые = Нежилое Тогда 
			Возврат Ложь;
		Иначе                 
			Возврат Истина;
		КонецЕсли;
		
	Иначе
		Возврат Истина;
	КонецЕсли;
		
КонецФункции

&НаКлиенте
Функция НайтиТиблицуШаблона(НомерСтраницы)
	
	Родители = Дерево.ПолучитьЭлементы();
	
	НомерСтраницыШаблона = 1;
	Для Каждого Элт Из Родители Цикл
		Если Элт.СтраницаКолонка = НомерСтраницы Тогда
			Возврат Новый Структура("ТаблицаШаблона, НомерСтраницыШаблона", Элт, НомерСтраницыШаблона);
		КонецЕсли;
		НомерСтраницыШаблона = НомерСтраницыШаблона + 1;
	КонецЦикла;
		
	Возврат Новый Структура("ТаблицаШаблона, НомерСтраницыШаблона", Неопределено, Неопределено);

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьМакетСтраницыСервер(ШаблонВыгрузкиГИСЖКХ)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ШаблонВыгрузкиГИСЖКХ, "МакетСтраницы").Получить();
	
КонецФункции

&НаСервере
Процедура СформироватьФайлСервер()
	
	Архивный = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ШаблонВыгрузкиГИСЖКХ, "Архивный");
	Если ЗначениеЗаполнено(Архивный)
		И Архивный Тогда
		ТекстСообщения = НСтр("ru = 'Данные сформированы по устаревшему (архивному) шаблону!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	СоответствиеДанныхМакета = Новый Соответствие;
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.бит_ФайлыГИСЖКХ"));
	
	ДанныеМакета = ДокументОбъект.СформироватьДанныеФайла();
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
	Для Каждого Таб Из ДанныеМакета Цикл
		Если Таб.Ключ = "Дерево" Тогда
			ЗначениеВРеквизитФормы(Таб.Значение, "Дерево");
			Продолжить;	
		КонецЕсли;
		СоответствиеДанныхМакета.Вставить(Таб.Ключ, ОбщегоНазначения.ТаблицаЗначенийВМассив(Таб.Значение));	
	КонецЦикла;
	СтруктураДанныхМакета = Новый ФиксированноеСоответствие(СоответствиеДанныхМакета);
	
КонецПроцедуры

&НаСервереБезКонтекста 
Функция ЭтоШаблонПлатежногоДокумента(Шаблон)  
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Шаблон, "ШаблонПлатежныхДокументов") = Истина Тогда
		Возврат Истина	
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте 
Функция НайтиПоследнююКолонку(Таблица)
	
	МаксимальноеЗначение = 0;
	
	Для Индекс = 0 По Таблица.Количество() - 1 Цикл
		Значение = Таблица[Индекс].СтраницаКолонка;
		
		Если МаксимальноеЗначение < Значение Тогда
			МаксимальноеЗначение = Значение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МаксимальноеЗначение;
	
КонецФункции

&НаКлиенте
Процедура ВсеДомаПриИзменении(Элемент)
	
	Если Объект.ВсеДома Тогда
		Объект.Нежилые = Ложь;
		Объект.Жилые = Ложь;
	Иначе
		Если НЕ Объект.Жилые И НЕ Объект.Нежилые Тогда
			Объект.ВсеДома = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НежилыеПриИзменении(Элемент)
	
	Если Объект.Нежилые Тогда
		Объект.ВсеДома = Ложь;
		Объект.Жилые = Ложь;
	Иначе
		Если НЕ Объект.Жилые И НЕ Объект.ВсеДома Тогда
			Объект.Нежилые = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЖилыеПриИзменении(Элемент)
	
	Если Объект.Жилые Тогда
		Объект.Нежилые = Ложь;
		Объект.ВсеДома = Ложь;
	Иначе
		Если НЕ Объект.ВсеДома И НЕ Объект.Нежилые Тогда
			Объект.Жилые = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУслугиНаСервере()
СписокПомеченных = новый массив;
для каждого Усл из Объект.Услуги цикл
	если Усл.метка = истина тогда
		СписокПомеченных.Добавить(усл.услуга);
	КонецЕсли;
КонецЦикла;

	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_УслугиЖКХ.Ссылка КАК Услуга,
		|	ВЫБОР
		|		КОГДА бит_УслугиЖКХ.Ссылка В (&СписокПомеченных)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Метка
		|ИЗ
		|	Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
		|
		|УПОРЯДОЧИТЬ ПО
		|	бит_УслугиЖКХ.Наименование";
	
	Запрос.УстановитьПараметр("СписокПомеченных", СписокПомеченных);
	
	Объект.Услуги.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУслуги(Команда)
	ЗаполнитьУслугиНаСервере();
КонецПроцедуры

&НаСервере
Процедура СнятьПоставитьФлажки(Метка)
	для каждого сч из Объект.Услуги цикл
		сч.метка = Метка;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеГалки(Команда)
	СнятьПоставитьФлажки(ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПоставитьВсеГалки(Команда)
	СнятьПоставитьФлажки(истина);
КонецПроцедуры

&НаКлиенте
Процедура ОплатыВсеСнять(Команда)
	СнятьПоставитьФлажки2(ложь);
КонецПроцедуры

&НаСервере
Процедура СнятьПоставитьФлажки2(Метка)
	для каждого сч из Объект.ВидыОплат цикл
		сч.метка = Метка;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОплатыВсеПоставить(Команда)
	СнятьПоставитьФлажки2(истина);
КонецПроцедуры

&НаСервере
Процедура ОплатыЗаполнитьНаСервере()
	СписокПомеченных = новый массив;
для каждого Усл из Объект.ВидыОплат цикл
	если Усл.метка = истина тогда
		СписокПомеченных.Добавить(усл.ВидОплаты);
	КонецЕсли;
КонецЦикла;

	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	лб_ВидыОплат.Ссылка КАК ВидОплаты,
		|	ВЫБОР
		|		КОГДА лб_ВидыОплат.Ссылка В (&СписокПомеченных)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Метка
		|ИЗ
		|	Справочник.лб_ВидыОплат КАК лб_ВидыОплат
		|
		|УПОРЯДОЧИТЬ ПО
		|	лб_ВидыОплат.Наименование";
	
	Запрос.УстановитьПараметр("СписокПомеченных", СписокПомеченных);
	
	Объект.ВидыОплат.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

&НаКлиенте
Процедура ОплатыЗаполнить(Команда)
	ОплатыЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоШаблонуПДНаСервере()
	// Вставить содержимое обработчика.
	
	Если Объект.Услуги.количество() тогда
		ЗаполнитьУслугиНаСервере()
	КонецЕсли;
	
	
	Если Объект.ШаблонВыгрузкиГИСЖКХ.ШаблонПлатежныхДокументов и ЗначениеЗаполнено(Объект.шаблонИзвещений) тогда
		для каждого с из Объект.Услуги цикл
			с.метка = ложь;
		КонецЦикла;
		
		для каждого с из Объект.ШаблонИзвещений.Услуги цикл
			парам = новый структура;
			парам.Вставить("Услуга",с.Услуга);
			строкаУс = объект.Услуги.НайтиСтроки(парам);
			попытка 
				строкаУс[0].метка = истина;
			исключение
			КонецПопытки;
			
				
			
		КонецЦикла;

		
	КонецЕсли;
	
		
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоШаблонуПД(Команда)
	ЗаполнитьПоШаблонуПДНаСервере();
КонецПроцедуры


#КонецОбласти
